In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({
    'NAZWA' : ['JABŁKA', 'GRUSZKI', 'MALINY'],
    'CENA' : ['zł 3.22', 'zł 3.22', 'zł 3.22']
})
df

     NAZWA     CENA
0   JABŁKA  zł 3.22
1  GRUSZKI  zł 3.22
2   MALINY  zł 3.22

In [5]:
remove_zl =lambda x: float(x[3:])
df['CENA_W_ZL'] = df.CENA.apply(remove_zl)

In [4]:
G = 'zł 3.22'
G[3:]

'3.22'

In [6]:
df

     NAZWA     CENA  CENA_W_ZL
0   JABŁKA  zł 3.22       3.22
1  GRUSZKI  zł 3.22       3.22
2   MALINY  zł 3.22       3.22

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   NAZWA      3 non-null      object
 1   CENA       3 non-null      object
 2   CENA_W_ZL  3 non-null      float64
dtypes: float64(1), object(2)
memory usage: 204.0+ bytes

In [12]:
#spacje
df = pd.DataFrame({
    'NAZWA' : ['JABŁKA ', 'GRUSZKI ', 'MALINY '],
    'CENA' : ['zł 3.22', 'zł 3.22', 'zł 3.22']
})
df

      NAZWA     CENA
0   JABŁKA   zł 3.22
1  GRUSZKI   zł 3.22
2   MALINY   zł 3.22

In [15]:
df.NAZWA.values

array(['JABŁKA ', 'GRUSZKI ', 'MALINY '], dtype=object)

In [16]:
df.NAZWA.str.strip().values # usuwanie spacji

array(['JABŁKA', 'GRUSZKI', 'MALINY'], dtype=object)

In [18]:
# or
df['NAZWA'] = df['NAZWA'].str.strip()
df

     NAZWA     CENA
0   JABŁKA  zł 3.22
1  GRUSZKI  zł 3.22
2   MALINY  zł 3.22

In [22]:
df =pd.DataFrame({
    "Address": ["4860 Sunser Boulevard,San Francisco,California nr 34",
                "3055 Paradise Lane,Salt Lake City,Utah",
                "682 Mian Street,Detroit,Michigan",
                "9001 Cascade Road,Kansas City,Missouri"]
})
df

                                             Address
0  4860 Sunser Boulevard,San Francisco,California...
1             3055 Paradise Lane,Salt Lake City,Utah
2                   682 Mian Street,Detroit,Michigan
3             9001 Cascade Road,Kansas City,Missouri

In [23]:
df['Address'].str.split(',', expand=True) # expand rozbija na kolumny

                       0               1                 2
0  4860 Sunser Boulevard   San Francisco  California nr 34
1     3055 Paradise Lane  Salt Lake City              Utah
2        682 Mian Street         Detroit          Michigan
3      9001 Cascade Road     Kansas City          Missouri

In [24]:
data = {
    'Name': ['Microsoft Corporation', 'Google, LLC', 'Tesla, Inc.',\
             'Apple Inc.', 'Netflix, Inc.'],
    'Symbol': ['MSFT', 'GOOG', 'TSLA', 'AAPL', 'NFLX'],
    'Industry': ['Tech', 'Tech', 'Automotive', 'Tech', 'Entertainment'],
    'Shares': [100, 50, 150, 200, 80],
    'Shares2': [1000, 500, 1500, 2000, 800]
}
df = pd.DataFrame(data)
df

                    Name Symbol       Industry  Shares  Shares2
0  Microsoft Corporation   MSFT           Tech     100     1000
1            Google, LLC   GOOG           Tech      50      500
2            Tesla, Inc.   TSLA     Automotive     150     1500
3             Apple Inc.   AAPL           Tech     200     2000
4          Netflix, Inc.   NFLX  Entertainment      80      800

In [26]:
# tylko te wiersze gdzie shares > 100
df[df.Shares > 100] # or df[df[Shares] > 100]

          Name Symbol    Industry  Shares  Shares2
2  Tesla, Inc.   TSLA  Automotive     150     1500
3   Apple Inc.   AAPL        Tech     200     2000

In [27]:
# jest rowne 100 shares
df[df.Shares == 100]

                    Name Symbol Industry  Shares  Shares2
0  Microsoft Corporation   MSFT     Tech     100     1000

In [29]:
# rozne niz 100 shares
df[df.Shares != 100]

            Name Symbol       Industry  Shares  Shares2
1    Google, LLC   GOOG           Tech      50      500
2    Tesla, Inc.   TSLA     Automotive     150     1500
3     Apple Inc.   AAPL           Tech     200     2000
4  Netflix, Inc.   NFLX  Entertainment      80      800

In [30]:
df[(df.Shares != 100) & (df.Shares2 != 500)] # and

            Name Symbol       Industry  Shares  Shares2
2    Tesla, Inc.   TSLA     Automotive     150     1500
3     Apple Inc.   AAPL           Tech     200     2000
4  Netflix, Inc.   NFLX  Entertainment      80      800

In [32]:
df[(df.Shares != 100) | (df.Shares2 != 500)] # lub

                    Name Symbol       Industry  Shares  Shares2
0  Microsoft Corporation   MSFT           Tech     100     1000
1            Google, LLC   GOOG           Tech      50      500
2            Tesla, Inc.   TSLA     Automotive     150     1500
3             Apple Inc.   AAPL           Tech     200     2000
4          Netflix, Inc.   NFLX  Entertainment      80      800

In [33]:
df[~(df.Shares != 100) | (df.Shares2 != 500)] # innercja, zaprzeczenie

                    Name Symbol       Industry  Shares  Shares2
0  Microsoft Corporation   MSFT           Tech     100     1000
2            Tesla, Inc.   TSLA     Automotive     150     1500
3             Apple Inc.   AAPL           Tech     200     2000
4          Netflix, Inc.   NFLX  Entertainment      80      800